spec/cassettes/BankAccount/_start_recurring_payments/sets_the_bank_account_to_be_recurring_active.yml

---
http_interactions:
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts
    body:
      encoding: UTF-8
      string: '{"account_number":"9900000002","account_type":"checking","name":"Johann
        Bernoulli","routing_number":"021000021"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Access-Control-Allow-Headers:
      - Content-Type
      Access-Control-Allow-Methods:
      - POST, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Content-Type:
      - application/json
      Date:
      - Tue, 07 Oct 2014 23:10:17 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM19b4ca344e7711e4975002a1fe53e539
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.22
      X-Midlr-Version:
      - '2'
      X-Newrelic-App-Data:
      - PxQFWFNXCQYTUllWAgAAU0YdFhE1AwE2QgNWEVlbQFtcCxYxSBVbDQoZVA4IF0pcXAgEEBhTVggPbldQAQkWDEQRFgFKXVVGVkcVQQFNE1JKBQNVU1QMCgJcU1oEBw5XUB0WAVBQT0ISBwBVCwsFB1IEX1ZUUVJaBhQbQQACVEBVOQ==
      Content-Length:
      - '1289'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": null
              },
              "can_credit": true,
              "created_at": "2014-10-07T23:10:17.059448Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-10-07T23:10:17.059452Z",
              "href": "/bank_accounts/BAMRIS2dx1SdY0cktjqMJ3i",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BAMRIS2dx1SdY0cktjqMJ3i"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Tue, 07 Oct 2014 23:10:17 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BAMRIS2dx1SdY0cktjqMJ3i
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 07 Oct 2014 23:10:17 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM1a4c49a44e7711e4892e0230f00c9248
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.22
      Content-Length:
      - '498'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": null
              },
              "can_credit": true,
              "created_at": "2014-10-07T23:10:17.059448Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-10-07T23:10:17.059452Z",
              "href": "/bank_accounts/BAMRIS2dx1SdY0cktjqMJ3i",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BAMRIS2dx1SdY0cktjqMJ3i"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Tue, 07 Oct 2014 23:10:17 GMT
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BAMRIS2dx1SdY0cktjqMJ3i/verifications
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 07 Oct 2014 23:10:26 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM1a84847c4e7711e4af160230f00c9248
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.22
      Content-Length:
      - '596'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "pending",
              "links": {
                "bank_account": "BAMRIS2dx1SdY0cktjqMJ3i"
              },
              "href": "/verifications/BZWOF85DFUsoUIMru7DOFMY",
              "created_at": "2014-10-07T23:10:25.904960Z",
              "attempts_remaining": 3,
              "updated_at": "2014-10-07T23:10:26.164115Z",
              "deposit_status": "succeeded",
              "attempts": 0,
              "meta": {},
              "id": "BZWOF85DFUsoUIMru7DOFMY"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Tue, 07 Oct 2014 23:10:26 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BAMRIS2dx1SdY0cktjqMJ3i
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 07 Oct 2014 23:10:27 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM1fd372f84e7711e4a4f602b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.22
      Content-Length:
      - '521'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": "BZWOF85DFUsoUIMru7DOFMY"
              },
              "can_credit": true,
              "created_at": "2014-10-07T23:10:17.059448Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-10-07T23:10:17.059452Z",
              "href": "/bank_accounts/BAMRIS2dx1SdY0cktjqMJ3i",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BAMRIS2dx1SdY0cktjqMJ3i"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Tue, 07 Oct 2014 23:10:27 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/verifications/BZWOF85DFUsoUIMru7DOFMY
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 07 Oct 2014 23:10:27 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM200fdbbc4e7711e49a3902b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.22
      Content-Length:
      - '596'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "pending",
              "links": {
                "bank_account": "BAMRIS2dx1SdY0cktjqMJ3i"
              },
              "href": "/verifications/BZWOF85DFUsoUIMru7DOFMY",
              "created_at": "2014-10-07T23:10:25.904960Z",
              "attempts_remaining": 3,
              "updated_at": "2014-10-07T23:10:26.164115Z",
              "deposit_status": "succeeded",
              "attempts": 0,
              "meta": {},
              "id": "BZWOF85DFUsoUIMru7DOFMY"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Tue, 07 Oct 2014 23:10:27 GMT
- request:
    method: put
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/verifications/BZWOF85DFUsoUIMru7DOFMY
    body:
      encoding: UTF-8
      string: '{"verification_status":"pending","links":{"bank_account":"BAMRIS2dx1SdY0cktjqMJ3i"},"created_at":"2014-10-07T23:10:25.904960Z","attempts_remaining":3,"updated_at":"2014-10-07T23:10:26.164115Z","deposit_status":"succeeded","attempts":0,"meta":{},"id":"BZWOF85DFUsoUIMru7DOFMY","amount_1":"1","amount_2":"1"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 07 Oct 2014 23:10:27 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM206126704e7711e4ae9d02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.22
      Content-Length:
      - '598'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "succeeded",
              "links": {
                "bank_account": "BAMRIS2dx1SdY0cktjqMJ3i"
              },
              "href": "/verifications/BZWOF85DFUsoUIMru7DOFMY",
              "created_at": "2014-10-07T23:10:25.904960Z",
              "attempts_remaining": 2,
              "updated_at": "2014-10-07T23:10:27.968462Z",
              "deposit_status": "succeeded",
              "attempts": 1,
              "meta": {},
              "id": "BZWOF85DFUsoUIMru7DOFMY"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Tue, 07 Oct 2014 23:10:28 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BAMRIS2dx1SdY0cktjqMJ3i
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 07 Oct 2014 23:10:28 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM20a9635e4e7711e4867106429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.22
      Content-Length:
      - '523'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": "BZWOF85DFUsoUIMru7DOFMY"
              },
              "can_credit": true,
              "created_at": "2014-10-07T23:10:17.059448Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-10-07T23:10:27.967549Z",
              "href": "/bank_accounts/BAMRIS2dx1SdY0cktjqMJ3i",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": true,
              "id": "BAMRIS2dx1SdY0cktjqMJ3i"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Tue, 07 Oct 2014 23:10:28 GMT
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BAMRIS2dx1SdY0cktjqMJ3i/debits
    body:
      encoding: UTF-8
      string: '{"amount":60000,"appears_on_statement_as":"Epicodus tuition"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Tue, 07 Oct 2014 23:10:29 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM210439c84e7711e4ae9d02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.22
      Content-Length:
      - '1062'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "debits": [
            {
              "status": "succeeded",
              "description": null,
              "links": {
                "customer": null,
                "source": "BAMRIS2dx1SdY0cktjqMJ3i",
                "card_hold": null,
                "order": null,
                "dispute": null
              },
              "updated_at": "2014-10-07T23:10:29.340376Z",
              "created_at": "2014-10-07T23:10:29.030989Z",
              "transaction_number": "WEZN-8MY-S1HE",
              "failure_reason": null,
              "currency": "USD",
              "amount": 60000,
              "failure_reason_code": null,
              "meta": {},
              "href": "/debits/WD10kvJhQnAQs0O3by2sTTsk",
              "appears_on_statement_as": "BAL*Epicodus tuition",
              "id": "WD10kvJhQnAQs0O3by2sTTsk"
            }
          ],
          "links": {
            "debits.customer": "/customers/{debits.customer}",
            "debits.order": "/orders/{debits.order}",
            "debits.dispute": "/disputes/{debits.dispute}",
            "debits.source": "/resources/{debits.source}",
            "debits.events": "/debits/{debits.id}/events",
            "debits.refunds": "/debits/{debits.id}/refunds",
            "debits.card_hold": "/holds/{debits.card_hold}"
          }
        }
    http_version: 
  recorded_at: Tue, 07 Oct 2014 23:10:29 GMT
recorded_with: VCR 2.9.3
